/*
 * _74HC595.c
 *
 * Created: 28.07.2022 20:24:04
 *  Author: Evgeniy
 */ 

 /*					edgcafb		bfacgde_
символ	abcdefg	  q	1234567

  0		1111110		1101111		00001000
  1		0110000		0001001		01101110
  2		1101101		1110101		01010000
  3		1111001		0111101		01000010
  4		0110011		0011011		00100110
  5		1011011		0111110		10000010
  6		1011111		1111110		10000000
  7		1110000		0001101		01001110
  8		1111111		1111111		00000000
  9		1111011		0111111		00000010
  O		1111110		1101111		00001000
  F		1000111		1010110		10010100
  N		1110110		1001111		00001100
  */

#include "74HC595.h"

#define CLEARBIT(x,y)	x&=~(1<<y)
#define SETBIT(x,y)		x|=1<<y

#define STSP_low		CLEARBIT(HC595_PORT,STSP)
#define STSP_high		SETBIT(HC595_PORT,STSP)

uint8_t simbol[13] = {	0b00001001, //0
 						0b01101111, //1
 						0b01010001, //2
 						0b01000011, //3
						0b00100111, //4
						0b10000011, //5
						0b10000001, //6
						0b01001111, //7
						0b00000001, //8
						0b00000011, //9
						0b00001001, //O
						0b10010101, //F
						0b00001101	}; //N							
							
void HC595_init(void)
{
	// Установка выводов SPI на вывод
	HC595_DDR|=(1<<STSP); //(1<<MOSI)|(1<<SCK); - иниц. в SPI2313.c
}

void HC595_send_data(uint8_t data)
{
	SPI_MasterTransmit(simbol[data]);
	STSP_high;
	STSP_low;	
}
